Revit 2024 API
BuiltInFailures.RebarSystemFailures.ThinHostFloorError Property
 Rebar Cover Top and Bottom are too large for host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ThinHostFloorError { get; }
Visual Basic
Public Shared ReadOnly Property ThinHostFloorError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ThinHostFloorError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace